In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from tabula import read_pdf

In [3]:
nirf_df = read_pdf("../data/pdf/1.IR-E-U-0456.pdf", pages='all', guess = False)

In [4]:
len(nirf_df)

13

# Table 0

In [5]:
table0_df = nirf_df[0]

In [6]:
table0_df.head()

             Academic Year  2021-22  2020-21 2019-20 2018-19 2017-18 2016-17
0  UG [4 Years Program(s)]      877      877     762     488       -       -
1  UG [5 Years Program(s)]      177      177     157     358     372       -
2   PG [2 Year Program(s)]      511      510       -       -       -       -
3   PG [3 Year Program(s)]      245      245     245       -       -       -

# Table 1

In [7]:
table1_df = nirf_df[1]

In [8]:
table1_df.head()

,(All programs\rof all years),No. of Male\rStudents,No. of Female\rStudents,Total Students,Within State\r(Including male\r& female),Outside State\r(Including male\r& female),Outside\rCountry\r(Including male\r& female),Economically\rBackward\r(Including male\r& female),Socially\rChallenged\r(SC+ST+OBC\rIncluding male\r& female),No. of students\rreceiving full\rtuition fee\rreimbursement\rfrom the State\rand Central\rGovernment,No. of students\rreceiving full\rtuition fee\rreimbursement\rfrom Institution\rFunds,No. of students\rreceiving full\rtuition fee\rreimbursement\rfrom the Private\rBodies,No. of students\rwho are not\rreceiving full\rtuition fee\rreimbursement
0,UG [4 Years\rProgram(s)],2489,583,3072,526,2544,2,355,1619,173,1079,344,378
1,UG [5 Years\rProgram(s)],1359,291,1650,349,1301,0,178,778,40,703,86,127
2,PG [2 Year\rProgram(s)],863,157,1020,76,925,19,276,530,0,714,81,11
3,PG [3 Year\rProgram(s)],753,148,901,167,734,0,327,332,0,390,192,77

In [9]:
table1_df = table1_df.iloc[:, :4]

table1_df.head()

,(All programs\rof all years),No. of Male\rStudents,No. of Female\rStudents,Total Students
0,UG [4 Years\rProgram(s)],2489,583,3072
1,UG [5 Years\rProgram(s)],1359,291,1650
2,PG [2 Year\rProgram(s)],863,157,1020
3,PG [3 Year\rProgram(s)],753,148,901

# Table 2

In [10]:
table2_df = nirf_df[2]

In [11]:
table2_df.head()

,Academic Year,No. of first year\rstudents intake in the\ryear,No. of first year\rstudents admitted in\rthe year,Academic Year.1,No. of students\radmitted through\rLateral entry,Academic Year.2,No. of students\rgraduating in\rminimum stipulated\rtime,No. of students\rplaced,Median salary of\rplaced graduates per\rannum(Amount in\rRs.),No. of students\rselected for Higher\rStudies
0,2016-17,466,465,2017-18,0,2019-20,374,286,1500000(Fifteen\rLakhs),43
1,2017-18,466,378,2018-19,0,2020-21,338,292,1500000(Fifteen\rLakhs),17
2,2018-19,488,414,2019-20,0,2021-22,388,297,1700000(Seventeen\rLaksh),78

In [12]:
table2_df.columns

Index(['Academic Year', 'No. of first year\rstudents intake in the\ryear',
       'No. of first year\rstudents admitted in\rthe year', 'Academic Year.1',
       'No. of students\radmitted through\rLateral entry', 'Academic Year.2',
       'No. of students\rgraduating in\rminimum stipulated\rtime',
       'No. of students\rplaced',
       'Median salary of\rplaced graduates per\rannum(Amount in\rRs.)',
       'No. of students\rselected for Higher\rStudies'],
      dtype='object')

In [14]:
table2_df['Median salary of\rplaced graduates per\rannum(Amount in\rRs.)']

0      1500000(Fifteen\rLakhs)
1      1500000(Fifteen\rLakhs)
2    1700000(Seventeen\rLaksh)
Name: Median salary of\rplaced graduates per\rannum(Amount in\rRs.), dtype: object

# Table 3

In [15]:
table3_df = nirf_df[3]

In [16]:
table3_df.head()

,Academic Year,No. of first year\rstudents intake in the\ryear,No. of first year\rstudents admitted in\rthe year,Academic Year.1,No. of students\radmitted through\rLateral entry,Academic Year.2,No. of students\rgraduating in\rminimum stipulated\rtime,No. of students\rplaced,Median salary of\rplaced graduates per\rannum(Amount in\rRs.),No. of students\rselected for Higher\rStudies
0,2015-16,372,346,2016-17,0,2019-20,316,248,1600000(Sixteen\rLakhs),41
1,2016-17,372,360,2017-18,0,2020-21,342,287,1550000(Fifteen Lakhs\rFifty thousand),29
2,2017-18,372,442,2018-19,0,2021-22,426,352,1896000(Eighteen\rLakhs Ninety Six\rThousand),65

# Table 4

In [14]:
table4_df = nirf_df[5]

In [15]:
table4_df.head()

,Ph.D (Student pursuing doctoral program till 2021-22),Unnamed: 0,Unnamed: 1,Unnamed: 2
0,NaN,Total Students,NaN,NaN
1,Full Time,69,NaN,NaN
2,Part Time,278,NaN,NaN
3,No. of Ph.D students graduated (including Inte...,NaN,NaN,NaN
4,NaN,2021-22,2020-21,2019-20

In [16]:
table4_df = table4_df.iloc[1:3, :2]

In [17]:
table4_df.head()

  Ph.D (Student pursuing doctoral program till 2021-22) Unnamed: 0
1                                          Full Time            69
2                                          Part Time           278

# Table 5

In [22]:
table5_df = nirf_df[6]

In [23]:
table5_df.head()

,Financial Year,2021-22,2020-21,2019-20
0,NaN,Utilised Amount,Utilised Amount,Utilised Amount
1,Annual Capital Expenditure on Academic Activit...,NaN,NaN,NaN
2,"Library ( Books, Journals and e-Resources only)",7142765 (Seventy One lakh Forty Two thousand S...,9170498 (Ninety One lakh seventy thousand four...,4542135 (Forty Five Lakhs Forty Two Thousand O...
3,New Equipment and software for Laboratories,59476057 (Five Crore Nighty Four Lakh Seventy ...,61156696 (Six Crore eleven lakh fifty six thou...,55027612 (Five Crore Fifty Lakh Twenty Seven T...
4,Engineering Workshops,15451631 (One Crore Fifty Four Lakh Fifty One ...,16878590 (One Crore sixty eight lakh seventy e...,16491816 (One Crore Sixty Four Lakh Ninety One...

In [24]:
table5_df = table5_df.iloc[2:, 1:]

In [25]:
table5_df.head()

,Financial Year,2021-22,2020-21,2019-20
2,"Library ( Books, Journals and e-Resources only)",7142765 (Seventy One lakh Forty Two thousand S...,9170498 (Ninety One lakh seventy thousand four...,4542135 (Forty Five Lakhs Forty Two Thousand O...
3,New Equipment and software for Laboratories,59476057 (Five Crore Nighty Four Lakh Seventy ...,61156696 (Six Crore eleven lakh fifty six thou...,55027612 (Five Crore Fifty Lakh Twenty Seven T...
4,Engineering Workshops,15451631 (One Crore Fifty Four Lakh Fifty One ...,16878590 (One Crore sixty eight lakh seventy e...,16491816 (One Crore Sixty Four Lakh Ninety One...
5,Other expenditure on creation of Capital Asset...,14953074 (One Crore Forty Nine Lakhs Fifty Thr...,7034712 (Seventy Lakhs Thirty Four thousand se...,8147079 (Eighty One Lakh Forty Seven Thousand ...

# Table 6

In [26]:
table6_df = nirf_df[7]

In [27]:
table6_df.head()

,Financial Year,2021-22,2020-21,2019-20
0,NaN,Utilised Amount,Utilised Amount,Utilised Amount
1,Annual Operational Expenditure,NaN,NaN,NaN
2,Salaries (Teaching and Non Teaching staff),687852978 (Sixty Eight Crore Seventy Eight Lak...,653995762 (Sixty Five Crore Thirty nine lakh n...,634374261 (Sixty Three Crore Forty Three Lakh ...
3,Maintenance of Academic Infrastructure or cons...,240419708 (Twenty Four Crore Four Lakh Ninetee...,180235223 (Eighteen crore two lakh thirty five...,201756591 (Twenty Crore Seventeen Lakh Fifty S...
4,Seminars/Conferences/Workshops,3638103 (Thirty Six Lakh Thirty Eight Thousand...,2861576 (Twenty Eight Lakh Sixty One Thousand ...,6913731 (Sixty Nine Lakh Thirteen Thousand Sev...

In [28]:
table6_df = table6_df.iloc[2:, :]

In [29]:
table6_df.head()

,Financial Year,2021-22,2020-21,2019-20
2,Salaries (Teaching and Non Teaching staff),687852978 (Sixty Eight Crore Seventy Eight Lak...,653995762 (Sixty Five Crore Thirty nine lakh n...,634374261 (Sixty Three Crore Forty Three Lakh ...
3,Maintenance of Academic Infrastructure or cons...,240419708 (Twenty Four Crore Four Lakh Ninetee...,180235223 (Eighteen crore two lakh thirty five...,201756591 (Twenty Crore Seventeen Lakh Fifty S...
4,Seminars/Conferences/Workshops,3638103 (Thirty Six Lakh Thirty Eight Thousand...,2861576 (Twenty Eight Lakh Sixty One Thousand ...,6913731 (Sixty Nine Lakh Thirteen Thousand Sev...

# Table 7

In [122]:
table7_df = nirf_df[8]

In [123]:
table7_df.head()

Empty DataFrame
Columns: [Financial Year, 2021-22, 2020-21, 2019-20]
Index: []

In [124]:
columns = table7_df.columns.values.tolist()

data_list = table7_df.values.tolist()

data_list

[]

In [125]:
table7_df = nirf_df[9]

In [126]:
table7_df.head()

,Total no. of Sponsored Projects,28,33,25
0,Total no. of Funding Agencies,22,11,13
1,Total Amount Received (Amount in Rupees),20910139,21741902,20266307
2,Amount Received in Words,Two Crore Nine Lakhs Ten thousand One hundred ...,Two Crore Seventeen Lakh Forty one thousand Ni...,Two crore two lakh sixty six thousand three hu...

In [127]:
data_list.append(table7_df.columns.values.tolist())

for value in table7_df.values.tolist():
    data_list.append(value)

data_list

[['Total no. of Sponsored Projects', '28', '33', '25'],
 ['Total no. of Funding Agencies', '22', '11', '13'],
 ['Total Amount Received (Amount in Rupees)',
  '20910139',
  '21741902',
  '20266307'],
 ['Amount Received in Words',
  'Two Crore Nine Lakhs Ten thousand One hundred Thirty Nine',
  'Two Crore Seventeen Lakh Forty one thousand Nine hundred\rTwo',
  'Two crore two lakh sixty six thousand three hundred seven']]

In [128]:
data_df = pd.DataFrame(data_list, columns=columns)

data_df

,Financial Year,2021-22,2020-21,2019-20
0,Total no. of Sponsored Projects,28,33,25
1,Total no. of Funding Agencies,22,11,13
2,Total Amount Received (Amount in Rupees),20910139,21741902,20266307
3,Amount Received in Words,Two Crore Nine Lakhs Ten thousand One hundred ...,Two Crore Seventeen Lakh Forty one thousand Ni...,Two crore two lakh sixty six thousand three hu...

# Table 8

In [36]:
table8_df = nirf_df[10]

In [37]:
table8_df.head()

,Financial Year,2021-22,2020-21,2019-20
0,Total no. of Consultancy Projects,53,27,11
1,Total no. of Client Organizations,50,27,11
2,Total Amount Received (Amount in Rupees),10646770,5088530,13879630
3,Amount Received in Words,One Crore Six Lakhs Forty six thousand Seven h...,Fifty lakh eighty eight thousand Five Hundred ...,One Crore Thirty Eight Lakh Seventy Nine Thous...

# Table 9

In [38]:
table9_df = nirf_df[11]

In [39]:
table9_df.head()

,1. Do your institution buildings have Lifts/Ramps?,"Yes, more than 80% of the buildings"
0,2. Do your institution have provision for walk...,Yes
1,3. Do your institution buildings have speciall...,"Yes, more than 80% of the buildings"

In [92]:
data = [table9_df.columns.values.tolist()]

data

[['1. Do your institution buildings have Lifts/Ramps?',
  'Yes, more than 80% of the buildings']]

In [93]:
for value in table9_df.values.tolist():
    data.append(value)

data

[['1. Do your institution buildings have Lifts/Ramps?',
  'Yes, more than 80% of the buildings'],
 ['2. Do your institution have provision for walking aids, including wheelchairs and transportation from one building to another for\rhandicapped students?',
  'Yes'],
 ['3. Do your institution buildings have specially designed toilets for handicapped students?',
  'Yes, more than 80% of the buildings']]

In [94]:
df = pd.DataFrame(data, columns=['Question', 'Answer'])

df

,Question,Answer
0,1. Do your institution buildings have Lifts/Ra...,"Yes, more than 80% of the buildings"
1,2. Do your institution have provision for walk...,Yes
2,3. Do your institution buildings have speciall...,"Yes, more than 80% of the buildings"

# Table 10

In [40]:
table10_df = nirf_df[12]

In [41]:
table10_df.head()

Empty DataFrame
Columns: [Number of faculty members entered, 394]
Index: []

In [95]:
data = [table10_df.columns.values.tolist()]

data

[['Number of faculty members entered', '394']]

In [96]:
for value in table10_df.values.tolist():
    data.append(value)

data

[['Number of faculty members entered', '394']]

In [97]:
df = pd.DataFrame(data, columns=['Question', 'Answer'])

df

                            Question Answer
0  Number of faculty members entered    394